# 6.2.5 Practical activity: Preparing quantitative data

In [7]:
# Import libraries.
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [8]:
from sklearn.metrics import r2_score, median_absolute_error, mean_absolute_error
from sklearn.metrics import median_absolute_error, mean_squared_error, mean_squared_log_error

import warnings
warnings.filterwarnings('ignore')

%matplotlib inline

In [9]:
# Get multiple outputs in the same cell.
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [10]:
# Import the CSV file with Pandas.
data = pd.read_csv('raw_sales.csv')

# View the DataFrame.
print(data.shape)
data.head()

(29580, 5)

              datesold  postcode   price propertyType  bedrooms
0  2007-02-07 00:00:00      2607  525000        house         4
1  2007-02-27 00:00:00      2906  290000        house         3
2  2007-03-07 00:00:00      2905  328000        house         3
3  2007-03-09 00:00:00      2905  380000        house         4
4  2007-03-21 00:00:00      2906  310000        house         3

In [11]:
# View the meta
print(data.info())
print("\n" + "-"*40 + "\n")
print(data.isnull().sum())
print("\n" + "-"*40 + "\n")
data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  object
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB
None

----------------------------------------

datesold        0
postcode        0
price           0
propertyType    0
bedrooms        0
dtype: int64

----------------------------------------

           postcode         price      bedrooms
count  29580.000000  2.958000e+04  29580.000000
mean    2730.249730  6.097363e+05      3.250169
std      146.717292  2.817079e+05      0.951275
min     2600.000000  5.650000e+04      0.000000
25%     2607.000000  4.400000e+05      3.000000
50%     2615.000000  5.500000e+05      3.000000
75%     2905.000000  7.050000e+05      4.000000
max     2914.000000  8.000000e+06      5.000000

In [12]:
# Create a plot of the data.
# Create a df for the count of bedrooms.
bedrooms = data['bedrooms'].value_counts().reset_index()

# View the df.
bedrooms.head()

   bedrooms  count
0         3  11933
1         4  10442
2         2   3598
3         5   1950
4         1   1627